[
    {
        "id": 1,
        "name": "Momo",
        "description": "Delicious Nepali dumplings filled with a mixture of minced meat, spices, and herbs, typically steamed and served with a spicy dipping sauce.",
        "ingredients": [
            "Minced chicken/pork",
            "Onion",
            "Garlic",
            "Ginger",
            "Coriander",
            "Cumin",
            "Turmeric",
            "Flour",
            "Salt",
            "Water"
        ],
        "steps": [
            "Prepare the dough by mixing flour, water, and salt in a bowl until smooth. Knead the dough for about 5 minutes until it becomes soft and elastic. Cover the dough with a damp cloth and let it rest for 30 minutes to allow it to rise slightly.",
            "In a large mixing bowl, combine minced meat, finely chopped onion, minced garlic, grated ginger, chopped coriander, cumin, turmeric, and salt. Mix the ingredients thoroughly until well combined and the mixture is evenly seasoned.",
            "Take a small portion of the dough and roll it out into a thin circle on a floured surface. Place a spoonful of the meat filling in the center of the circle. Gently fold the edges of the dough over the filling to form a half-moon shape, then pinch the edges together to seal the dumpling. For a pleated look, you can fold the edges over and pinch them together.",
            "Arrange the filled dumplings on a steaming rack lined with parchment paper, making sure they are not touching each other. Steam the momos over boiling water for about 15-20 minutes, or until the dough is translucent and the filling is fully cooked.",
            "Remove the steamed momos from the steamer and serve them hot with a spicy tomato chutney or a tangy dipping sauce of your choice."
        ],
        "meta": {
            "servings": 4,
            "category": "Main Course",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "1 hour",
        "rating": 4.8,
        "date_published": "August 15, 2023",
        "imageUrl": "images/momo.jpg",
        "comments": [
            "These momos are incredible! The filling is perfectly spiced, and the dough is soft and chewy.",
            "I love how authentic these momos taste. The recipe is spot on, and they turned out just like the ones I had in Nepal.",
            "A bit too spicy for my taste, but overall, they are delicious and well worth the effort."
        ]
    },
    {
        "id": 2,
        "name": "Gundruk",
        "description": "Fermented leafy vegetable dish popular in Nepal, usually made from mustard, radish, or cauliflower leaves.",
        "ingredients": [
            "Mustard leaves",
            "Radish leaves",
            "Salt",
            "Water"
        ],
        "steps": [
            "Thoroughly wash the mustard and radish leaves to remove any dirt or impurities. Pat the leaves dry with a clean towel and spread them out in a single layer to dry in the sun for a few days until they become slightly wilted. This process helps to reduce the moisture content and makes the leaves easier to ferment.",
            "Once the leaves are wilted, tightly pack them into a clean, airtight container. Add salt to the leaves as you pack them, which helps to draw out moisture and aids in the fermentation process.",
            "Seal the container tightly and leave it in a warm, dark place for 1-2 weeks to allow the leaves to ferment. During this time, the leaves will develop a tangy flavor as they undergo the fermentation process.",
            "After fermentation, remove the leaves from the container and spread them out on a clean surface to dry in the sun until they are crispy. This drying step helps to preserve the gundruk and intensify its flavor.",
            "Once dried, store the gundruk in an airtight container. You can use it in various dishes, such as by frying it with onions and spices to enhance its flavor before serving."
        ],
        "meta": {
            "servings": 6,
            "category": "Side Dish",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "2 weeks (for fermentation)",
        "rating": 4.5,
        "date_published": "July 12, 2023",
        "imageUrl": "images/gundruk.jpg",
        "comments": [
            "I love the tangy flavor of gundruk. It's a unique side dish that adds a lot of character to any meal.",
            "The fermentation process took longer than expected, but the result was worth it. The gundruk has a great depth of flavor.",
            "A bit too sour for my taste, but definitely a traditional dish worth trying."
        ]
    },
    {
        "id": 3,
        "name": "Kwati",
        "description": "A traditional Nepali mixed bean soup, typically made during festivals like Janai Purnima.",
        "ingredients": [
            "Black-eyed peas",
            "Kidney beans",
            "Green peas",
            "Black beans",
            "Cumin",
            "Garlic",
            "Onion",
            "Turmeric",
            "Salt",
            "Ghee"
        ],
        "steps": [
            "Soak all the beans (black-eyed peas, kidney beans, green peas, and black beans) in a large bowl of water overnight. This step helps to soften the beans and reduce cooking time.",
            "Drain the soaked beans and rinse them under cold water. In a large pot, heat ghee over medium heat. Add finely chopped garlic and onions, and sauté until they turn golden brown and become fragrant.",
            "Add cumin, turmeric, and salt to the pot and stir for a minute to release their flavors. Then, add the soaked beans to the pot and stir to coat them with the spices.",
            "Pour enough water into the pot to cover the beans by about 2 inches. Bring the mixture to a boil, then reduce the heat to low and let it simmer for 2-3 hours, or until the beans are soft and tender. Stir occasionally and add more water if needed to maintain the desired consistency.",
            "Once the beans are cooked and the flavors have melded together, serve the soup hot with rice or bread. Enjoy this hearty and nutritious dish that is perfect for special occasions and festivals."
        ],
        "meta": {
            "servings": 4,
            "category": "Soup",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "3 hours",
        "rating": 4.7,
        "date_published": "July 20, 2023",
        "imageUrl": "images/kwati.jpg",
        "comments": [
            "This soup is perfect for chilly evenings. The combination of beans and spices is incredibly satisfying.",
            "The recipe is authentic and brings back great memories of Janai Purnima. The soup has a wonderful, rich flavor.",
            "It took a while to cook, but the end result was delicious. I might add a bit more salt next time."
        ]
    },
    {
        "id": 4,
        "name": "Dal Bhat",
        "description": "A staple Nepali dish of lentil soup (dal) served with rice (bhat) and various accompaniments.",
        "ingredients": [
            "Rice",
            "Lentils",
            "Garlic",
            "Onion",
            "Turmeric",
            "Salt",
            "Ghee"
        ],
        "steps": [
            "Rinse the lentils under cold water and then cook them in a pot with water, turmeric, and salt. Bring to a boil and then reduce the heat to low, simmering until the lentils are soft and fully cooked, which usually takes about 30-40 minutes. Stir occasionally and add more water if needed.",
            "In a separate pan, heat ghee over medium heat. Add finely chopped garlic and onions, and sauté until they turn golden brown and release a pleasant aroma. This process adds a depth of flavor to the lentil soup.",
            "Pour the garlic and onion mixture into the cooked lentils. Stir well and let it simmer for an additional 10 minutes to allow the flavors to meld together.",
            "Cook the rice separately according to the package instructions until fluffy and tender. You can use a rice cooker or cook it on the stovetop.",
            "Serve the hot lentil soup (dal) over a bed of rice (bhat) along with side dishes such as vegetables, pickles, or yogurt for a complete and satisfying meal."
        ],
        "meta": {
            "servings": 4,
            "category": "Main Course",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "1 hour",
        "rating": 5.0,
        "date_published": "August 1, 2023",
        "imageUrl": "images/dal-bhat.jpg",
        "comments": [
            "Dal Bhat is a classic Nepali dish that never fails to please. Simple, comforting, and delicious.",
            "The recipe is straightforward and turns out perfect every time. It's a staple in our home.",
            "I might add a bit more spice next time for extra flavor, but overall, it's fantastic!"
        ]
    },
    {
        "id": 5,
        "name": "Chatamari",
        "description": "A traditional Nepali rice crepe, often enjoyed as a snack or appetizer, with various toppings.",
        "ingredients": [
            "Rice flour",
            "Water",
            "Salt",
            "Onion",
            "Tomato",
            "Green chili",
            "Oil"
        ],
        "steps": [
            "In a large bowl, mix rice flour with water to form a smooth, thin batter. The consistency should be similar to pancake batter. Add a pinch of salt to the batter and mix well.",
            "Heat a non-stick pan or griddle over medium heat and lightly grease it with oil. Pour a ladleful of the batter onto the pan and spread it out into a thin, even circle using the back of the ladle.",
            "Cook the batter for 2-3 minutes until the edges start to lift and the bottom becomes golden brown. Flip the chatamari and cook the other side for an additional 1-2 minutes.",
            "Top the chatamari with finely chopped onions, tomatoes, and green chilies while it is still hot. You can also add other toppings like minced meat or chopped cilantro if desired.",
            "Serve the chatamari warm as a snack or appetizer. It pairs well with a variety of chutneys and dips."
        ],
        "meta": {
            "servings": 4,
            "category": "Snack",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "30 minutes",
        "rating": 4.4,
        "date_published": "July 25, 2023",
        "imageUrl": "images/chatamari.jpg",
        "comments": [
            "Chatamari is one of my favorite snacks. The recipe is easy to follow and the crepes turn out perfectly crispy.",
            "I love how versatile this dish is. You can add so many different toppings to suit your taste.",
            "The batter was a bit too thin; I added a bit more rice flour. The result was still delicious, though."
        ]
    },
    {
        "id": 6,
        "name": "Aloo Tama",
        "description": "A popular Nepali curry made with potatoes and bamboo shoots, cooked in a flavorful and spicy sauce.",
        "ingredients": [
            "Potatoes",
            "Bamboo shoots",
            "Onion",
            "Tomato",
            "Garlic",
            "Ginger",
            "Turmeric",
            "Cumin",
            "Salt",
            "Oil"
        ],
        "steps": [
            "Peel and chop the potatoes into bite-sized pieces. If using canned bamboo shoots, drain and rinse them. If using fresh bamboo shoots, peel and cut them into strips.",
            "In a large pan, heat oil over medium heat. Add finely chopped onions, garlic, and ginger. Sauté until the onions become golden brown and the mixture is fragrant.",
            "Add chopped tomatoes, turmeric, cumin, and salt. Cook until the tomatoes are soft and the spices are well combined.",
            "Add the chopped potatoes and bamboo shoots to the pan. Stir to coat them with the spice mixture.",
            "Pour in enough water to cover the potatoes and bamboo shoots. Bring to a boil, then reduce the heat to low and simmer until the potatoes are tender and the sauce has thickened, about 20-25 minutes.",
            "Serve the Aloo Tama hot with rice or roti."
        ],
        "meta": {
            "servings": 4,
            "category": "Main Course",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "45 minutes",
        "rating": 4.3,
        "date_published": "September 10, 2023",
        "imageUrl": "images/alu-tama.jpg",
        "comments": [
            "Aloo Tama is a classic Nepali dish that I love. The flavors are fantastic and it's perfect with rice.",
            "The recipe is straightforward, but I added a bit more chili for some extra heat. Delicious!",
            "The bamboo shoots were a bit tough; I'll try cooking them a bit longer next time."
        ]
    },
    {
        "id": 7,
        "name": "Thukpa",
        "description": "A comforting Nepali noodle soup made with meat or vegetables and a flavorful broth.",
        "ingredients": [
            "Noodles",
            "Beef or chicken",
            "Onion",
            "Garlic",
            "Ginger",
            "Cabbage",
            "Carrot",
            "Tomato",
            "Soy sauce",
            "Salt",
            "Oil"
        ],
        "steps": [
            "Cook the noodles according to the package instructions, then drain and set aside.",
            "In a large pot, heat oil over medium heat. Add chopped onions, garlic, and ginger, and sauté until the onions are golden brown.",
            "Add diced beef or chicken to the pot and cook until browned on all sides.",
            "Add chopped tomatoes, soy sauce, and salt. Stir well and cook until the tomatoes are soft.",
            "Add shredded cabbage and sliced carrots to the pot. Pour in enough water to cover the ingredients and bring to a boil.",
            "Reduce the heat and simmer until the meat and vegetables are cooked through, about 20 minutes.",
            "Add the cooked noodles to the pot and stir to combine. Simmer for an additional 5 minutes.",
            "Serve the Thukpa hot, garnished with chopped cilantro or green onions if desired."
        ],
        "meta": {
            "servings": 4,
            "category": "Soup",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "45 minutes",
        "rating": 4.6,
        "date_published": "August 5, 2023",
        "imageUrl": "images/thukpa.jpg",
        "comments": [
            "Thukpa is a comforting meal that's perfect for cold days. The broth is flavorful and the noodles are a great addition.",
            "I love the balance of meat and vegetables in this soup. It’s a complete meal on its own.",
            "The recipe is good, but I added a bit more soy sauce for extra flavor. Turned out great!"
        ]
    },
    {
        "id": 8,
        "name": "Sel Roti",
        "description": "A traditional Nepali rice flour donut that is crispy on the outside and soft on the inside.",
        "ingredients": [
            "Rice flour",
            "Sugar",
            "Water",
            "Cardamom",
            "Oil"
        ],
        "steps": [
            "In a large mixing bowl, combine rice flour and sugar. Gradually add water to the mixture while stirring until a smooth batter forms. The batter should have a consistency similar to pancake batter.",
            "Add ground cardamom to the batter and mix well. The cardamom adds a lovely aroma and flavor to the sel roti.",
            "Heat oil in a deep frying pan or a wok over medium heat. Once the oil is hot, pour a small amount of batter into the oil to form a donut shape. Use a spoon or ladle to shape the batter into a ring shape while frying. Fry the sel roti until golden brown and crispy on both sides, then remove and drain on paper towels.",
            "Serve the sel roti warm as a sweet treat or as part of a festive meal. Enjoy the crispy exterior and soft interior of this traditional Nepali donut."
        ],
        "meta": {
            "servings": 10,
            "category": "Dessert",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "30 minutes",
        "rating": 4.6,
        "date_published": "August 22, 2023",
        "imageUrl": "images/sel-roti.jpg",
        "comments": [
            "Sel Roti is my favorite Nepali sweet. This recipe makes them just right—crispy and fluffy.",
            "I love making sel roti for special occasions. This recipe is easy to follow and turns out great every time.",
            "The batter was a bit thick; I added a bit more water. The result was still delicious, but a bit more adjustment needed."
        ]
    },
    {
        "id": 9,
        "name": "Kheer",
        "description": "A sweet, creamy rice pudding made with milk, rice, sugar, and flavored with cardamom and nuts.",
        "ingredients": [
            "Rice",
            "Milk",
            "Sugar",
            "Cardamom",
            "Cashews",
            "Almonds",
            "Raisins",
            "Ghee"
        ],
        "steps": [
            "Rinse the rice under cold water and then drain. In a large pot, heat ghee over medium heat. Add the rinsed rice and sauté for a few minutes until it becomes slightly translucent.",
            "Pour milk into the pot and bring to a boil, stirring occasionally to prevent the rice from sticking to the bottom of the pot.",
            "Reduce the heat to low and simmer the rice and milk mixture, stirring frequently, until the rice is cooked and the mixture has thickened to a creamy consistency, about 30-40 minutes.",
            "Add sugar, cardamom, cashews, almonds, and raisins to the pot. Stir well and cook for an additional 5-10 minutes, until the sugar is fully dissolved and the nuts are tender.",
            "Remove from heat and let the kheer cool slightly before serving. Enjoy it warm or chilled, garnished with additional nuts if desired."
        ],
        "meta": {
            "servings": 6,
            "category": "Dessert",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "1 hour",
        "rating": 4.9,
        "date_published": "August 30, 2023",
        "imageUrl": "images/kheer.jpg",
        "comments": [
            "Kheer is a wonderful, comforting dessert. The recipe is perfect and the pudding turns out creamy and delicious.",
            "I love the addition of nuts and cardamom—it really enhances the flavor of the kheer.",
            "The cooking time was a bit longer than expected, but the end result was worth it. Fantastic recipe!"
        ]
    },
    {
        "id": 10,
        "name": "Pulao",
        "description": "A flavorful Nepali rice dish cooked with spices and vegetables, often served as a side or main course.",
        "ingredients": [
            "Rice",
            "Mixed vegetables (carrots, peas, beans)",
            "Onion",
            "Garlic",
            "Ginger",
            "Cumin",
            "Coriander",
            "Turmeric",
            "Salt",
            "Oil"
        ],
        "steps": [
            "Rinse the rice under cold water and then soak it for 30 minutes. Drain and set aside.",
            "In a large pot, heat oil over medium heat. Add chopped onions, garlic, and ginger. Sauté until the onions are golden brown.",
            "Add cumin, coriander, turmeric, and salt. Stir for a minute to release the spices' flavors.",
            "Add the mixed vegetables and cook for a few minutes until they start to soften.",
            "Add the drained rice to the pot and stir to coat the rice with the spices and vegetables.",
            "Pour in enough water to cover the rice by about 1 inch. Bring to a boil, then reduce the heat to low and cover the pot. Cook until the rice is tender and the water is absorbed, about 15-20 minutes.",
            "Fluff the rice with a fork and serve hot, garnished with chopped cilantro or fried onions if desired."
        ],
        "meta": {
            "servings": 4,
            "category": "Side Dish",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "30 minutes",
        "rating": 4.5,
        "date_published": "September 5, 2023",
        "imageUrl": "images/pulao.jpg",
        "comments": [
            "This pulao is a great side dish. The vegetables and spices make it flavorful and satisfying.",
            "I added a bit more cumin for extra flavor. The recipe is good, but adjusting the spices to taste made it even better.",
            "The rice was slightly undercooked. I’ll try adding a bit more water next time."
        ]
    },
    {
        "id": 11,
        "name": "Juju Dhau",
        "description": "A traditional Nepali yogurt made from buffalo milk, known for its rich, creamy texture and tangy flavor.",
        "ingredients": [
            "Buffalo milk",
            "Yogurt starter culture"
        ],
        "steps": [
            "Heat the buffalo milk in a large pot over medium heat until it comes to a boil. Stir occasionally to prevent the milk from scorching.",
            "Once the milk reaches a boil, remove it from the heat and let it cool to about 110°F (43°C). The milk should be warm but not hot to the touch.",
            "Add a small amount of yogurt starter culture to the cooled milk and stir gently to combine.",
            "Cover the pot with a clean cloth and place it in a warm, draft-free area to set for 6-8 hours or until the yogurt has thickened and developed a tangy flavor.",
            "Once set, refrigerate the yogurt to chill before serving. Enjoy the creamy, rich Juju Dhau as a dessert or a side dish."
        ],
        "meta": {
            "servings": 6,
            "category": "Dessert",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "8 hours",
        "rating": 4.8,
        "date_published": "September 7, 2023",
        "imageUrl": "images/juju-dhau.jpg",
        "comments": [
            "Juju Dhau is incredibly creamy and rich. This recipe captures the traditional flavor perfectly.",
            "The yogurt set beautifully and has a wonderful tangy taste. It's just like the ones from Nepal.",
            "I had to let it set a bit longer than 8 hours for a thicker consistency, but it turned out great!"
        ]
    },
    {
        "id": 12,
        "name": "Mutton Curry",
        "description": "A flavorful Nepali curry made with tender mutton, cooked in a spicy and aromatic sauce.",
        "ingredients": [
            "Mutton",
            "Onion",
            "Garlic",
            "Ginger",
            "Tomato",
            "Cumin",
            "Coriander",
            "Turmeric",
            "Red chili powder",
            "Salt",
            "Oil"
        ],
        "steps": [
            "Cut the mutton into bite-sized pieces and set aside.",
            "In a large pot, heat oil over medium heat. Add chopped onions, garlic, and ginger. Sauté until the onions turn golden brown.",
            "Add cumin, coriander, turmeric, red chili powder, and salt. Stir for a minute to release the spices' flavors.",
            "Add chopped tomatoes and cook until they become soft and the oil starts to separate from the mixture.",
            "Add the mutton pieces to the pot and stir to coat them with the spice mixture.",
            "Pour in enough water to cover the mutton. Bring to a boil, then reduce the heat to low and simmer for 1-2 hours, or until the mutton is tender and the sauce has thickened.",
            "Serve the mutton curry hot with rice or roti."
        ],
        "meta": {
            "servings": 4,
            "category": "Main Course",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "2 hours",
        "rating": 4.7,
        "date_published": "September 9, 2023",
        "imageUrl": "images/masu.jpg",
        "comments": [
            "The mutton curry is packed with flavor and the meat is incredibly tender. A great recipe!",
            "I love the blend of spices in this curry. It's perfect with rice and naan.",
            "The cooking time was a bit long, but the end result was worth it. Delicious and hearty."
        ]
    },
    {
        "id": 13,
        "name": "Thukpa",
        "description": "A spicy Nepali curry made with pork and potatoes, known for its rich and flavorful sauce.",
        "ingredients": [
            "Pork",
            "Potatoes",
            "Onion",
            "Garlic",
            "Ginger",
            "Tomato",
            "Cumin",
            "Coriander",
            "Turmeric",
            "Red chili powder",
            "Salt",
            "Oil"
        ],
        "steps": [
            "Cut the pork into bite-sized pieces and peel and chop the potatoes.",
            "In a large pan, heat oil over medium heat. Add chopped onions, garlic, and ginger. Sauté until the onions turn golden brown.",
            "Add cumin, coriander, turmeric, red chili powder, and salt. Stir for a minute to release the spices' flavors.",
            "Add chopped tomatoes and cook until they become soft and the oil starts to separate from the mixture.",
            "Add the pork pieces and potatoes to the pan. Stir well to coat them with the spice mixture.",
            "Pour in enough water to cover the pork and potatoes. Bring to a boil, then reduce the heat to low and simmer until the pork is tender and the potatoes are cooked through, about 30-40 minutes.",
            "Serve the Thukpa hot with rice or roti."
        ],
        "meta": {
            "servings": 4,
            "category": "Main Course",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "1 hour",
        "rating": 4.6,
        "date_published": "September 12, 2023",
        "imageUrl": "images/thukpa.jpg",
        "comments": [
            "Thukpa is a fantastic pork dish. The sauce is rich and the meat is tender.",
            "The recipe is great, but I added a bit more chili for extra heat. Turned out perfect!",
            "The potatoes took a bit longer to cook, but the end result was delicious."
        ]
    },
    {
        "id": 14,
        "name": "Chana Masala",
        "description": "A spicy and savory chickpea curry popular in Nepali cuisine, cooked with onions, tomatoes, and a blend of spices.",
        "ingredients": [
            "Chickpeas",
            "Onion",
            "Garlic",
            "Ginger",
            "Tomato",
            "Cumin",
            "Coriander",
            "Turmeric",
            "Red chili powder",
            "Salt",
            "Oil"
        ],
        "steps": [
            "Soak the chickpeas overnight in plenty of water. Drain and rinse them before cooking.",
            "In a large pan, heat oil over medium heat. Add chopped onions, garlic, and ginger. Sauté until the onions are golden brown.",
            "Add cumin, coriander, turmeric, red chili powder, and salt. Stir for a minute to release the spices' flavors.",
            "Add chopped tomatoes and cook until they become soft and the oil starts to separate from the mixture.",
            "Add the soaked chickpeas to the pan and stir well to coat them with the spice mixture.",
            "Pour in enough water to cover the chickpeas. Bring to a boil, then reduce the heat to low and simmer until the chickpeas are tender and the sauce has thickened, about 30-40 minutes.",
            "Serve the Chana Masala hot with rice or roti."
        ],
        "meta": {
            "servings": 4,
            "category": "Main Course",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "1 hour",
        "rating": 4.5,
        "date_published": "September 15, 2023",
        "imageUrl": "images/chana-masala.jpg",
        "comments": [
            "Chana Masala is always a hit at my house. The spices are perfect and the chickpeas are tender.",
            "I added a bit of lemon juice at the end for extra flavor. Delicious!",
            "The recipe is great, but I found the cooking time a bit long. Might try a pressure cooker next time."
        ]
    },
    {
        "id": 16,
        "name": "Makaiko Roti",
        "description": "A traditional Nepali corn-based flatbread, usually served with pickles or yogurt.",
        "ingredients": [
            "Corn flour",
            "Wheat flour",
            "Salt",
            "Water",
            "Oil"
        ],
        "steps": [
            "Mix corn flour, wheat flour, and salt with water to form a dough.",
            "Let the dough rest for 15 minutes.",
            "Shape the dough into flat discs and cook them in a frying pan with oil until both sides are golden.",
            "Serve with pickles or yogurt."
        ],
        "meta": {
            "servings": 6,
            "category": "Bread",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "30 minutes",
        "rating": 4.2,
        "date_published": "September 8, 2023",
        "imageUrl": "images/makaiko-roti.jpg",
        "comments": [
            "Perfect for a quick and simple meal.",
            "Great texture when served fresh off the pan.",
            "Pairs well with spicy pickles or cooling yogurt."
        ]
    },
    {
        "id": 17,
        "name": "Sukuti",
        "description": "Dried buffalo meat often served with spicy tomato chutney in Nepal.",
        "ingredients": [
            "Buffalo meat",
            "Garlic",
            "Ginger",
            "Cumin",
            "Chili powder",
            "Tomatoes",
            "Coriander"
        ],
        "steps": [
            "Cut buffalo meat into thin strips and marinate with garlic, ginger, cumin, and chili powder.",
            "Dry the meat in the sun for 2-3 days until fully dehydrated.",
            "Grill or fry the dried meat and serve with spicy tomato chutney."
        ],
        "meta": {
            "servings": 4,
            "category": "Appetizer",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "3 days (for drying)",
        "rating": 4.6,
        "date_published": "August 12, 2023",
        "imageUrl": "images/sukuti.jpg",
        "comments": [
            "Ideal for making in bulk and storing for later.",
            "The spicy chutney complements the flavors of the dried meat.",
            "A unique taste that highlights traditional Nepali preservation techniques."
        ]
    },
    {
        "id": 18,
        "name": "Tongba",
        "description": "A traditional alcoholic beverage made from fermented millet and consumed with hot water.",
        "ingredients": [
            "Fermented millet",
            "Hot water"
        ],
        "steps": [
            "Fill a large container with fermented millet.",
            "Pour hot water over the millet and let it sit for a few minutes.",
            "Drink the resulting liquid through a bamboo straw, refilling with hot water as needed."
        ],
        "meta": {
            "servings": 1,
            "category": "Beverage",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "10 minutes",
        "rating": 4.9,
        "date_published": "September 15, 2023",
        "imageUrl": "images/tongba.jpg",
        "comments": [
            "A refreshing drink with a unique taste.",
            "Best enjoyed in a social setting with friends.",
            "A traditional choice for cold weather and special occasions."
        ]
    },
    {
        "id": 19,
        "name": "Kachila",
        "description": "A spicy raw buffalo meat dish from the Newar community, often eaten with beaten rice.",
        "ingredients": [
            "Buffalo meat",
            "Garlic",
            "Ginger",
            "Cumin",
            "Chili powder",
            "Mustard oil"
        ],
        "steps": [
            "Finely chop raw buffalo meat and mix with garlic, ginger, cumin, and chili powder.",
            "Toss the meat with mustard oil to enhance the flavor.",
            "Serve immediately with beaten rice and pickles."
        ],
        "meta": {
            "servings": 4,
            "category": "Appetizer",
            "cuisine": "Newari"
        },
        "total_cooking_time": "30 minutes",
        "rating": 4.5,
        "date_published": "July 18, 2023",
        "imageUrl": "images/kachila.jpg",
        "comments": [
            "A bold and flavorful dish for adventurous eaters.",
            "Mustard oil adds a distinctive taste to the meat.",
            "Best enjoyed fresh to fully appreciate the flavors."
        ]
    },
    {
        "id": 20,
        "name": "Thukpa",
        "description": "A warm noodle soup of Tibetan origin, often made with vegetables and meat.",
        "ingredients": [
            "Noodles",
            "Chicken",
            "Garlic",
            "Ginger",
            "Onion",
            "Carrots",
            "Cabbage",
            "Cumin",
            "Chili powder"
        ],
        "steps": [
            "Boil noodles and set aside.",
            "In a separate pot, sauté garlic, ginger, and onions until fragrant.",
            "Add chicken, carrots, cabbage, cumin, and chili powder, and cook until the vegetables are soft and the chicken is fully cooked.",
            "Pour in water or broth, and simmer for 10-15 minutes.",
            "Add the cooked noodles and serve hot."
        ],
        "meta": {
            "servings": 4,
            "category": "Soup",
            "cuisine": "Tibetan"
        },
        "total_cooking_time": "45 minutes",
        "rating": 4.8,
        "date_published": "August 20, 2023",
        "imageUrl": "images/thukpa.jpg",
        "comments": [
            "Comforting and hearty, perfect for cold days.",
            "Flexible recipe that can be adjusted with various vegetables.",
            "Pairs well with a side of crispy bread or dumplings."
        ]
    },
    {
        "id": 21,
        "name": "Bhakka",
        "description": "A steamed rice cake commonly eaten in eastern Nepal, often served with pickles or chutney.",
        "ingredients": [
            "Rice flour",
            "Water",
            "Salt"
        ],
        "steps": [
            "Mix rice flour, water, and salt to form a thick dough.",
            "Shape the dough into small round cakes and place them in a steamer.",
            "Steam the cakes for 10-15 minutes until fully cooked.",
            "Serve hot with pickles or chutney."
        ],
        "meta": {
            "servings": 4,
            "category": "Snack",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "30 minutes",
        "rating": 4.3,
        "date_published": "July 25, 2023",
        "imageUrl": "images/bhakka.jpg",
        "comments": [
            "A simple and traditional snack with a soft texture.",
            "Great with a variety of accompaniments like pickles or chutney.",
            "A staple in many Nepali households."
        ]
    },
    {
        "id": 22,
        "name": "Fapar ko Roti",
        "description": "A traditional Nepali flatbread made from buckwheat flour, often served with vegetables or pickles.",
        "ingredients": [
            "Buckwheat flour",
            "Water",
            "Salt",
            "Oil"
        ],
        "steps": [
            "Mix buckwheat flour, water, and salt to form a dough.",
            "Shape the dough into flat discs and cook in a frying pan with oil until golden brown.",
            "Serve hot with vegetables or pickles."
        ],
        "meta": {
            "servings": 6,
            "category": "Bread",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "30 minutes",
        "rating": 4.4,
        "date_published": "July 10, 2023",
        "imageUrl": "images/fapar-ko-roti.jpg",
        "comments": [
            "Nutty and wholesome flavor from the buckwheat.",
            "Pairs well with traditional Nepali sides and curries.",
            "A great alternative to regular wheat-based bread."
        ]
    },
    {
        "id": 23,
        "name": "Golbheda ko Achar",
        "description": "A tangy tomato pickle, often served with rice or roti in Nepal.",
        "ingredients": [
            "Tomatoes",
            "Garlic",
            "Ginger",
            "Cumin",
            "Turmeric",
            "Green chili",
            "Coriander"
        ],
        "steps": [
            "Roast tomatoes over an open flame until charred and soft.",
            "In a pan, heat oil and sauté garlic, ginger, cumin, turmeric, and green chili.",
            "Mash the roasted tomatoes and add them to the pan, mixing well with the spices.",
            "Cook for 5-10 minutes and garnish with fresh coriander.",
            "Serve hot or cold with rice or roti."
        ],
        "meta": {
            "servings": 4,
            "category": "Side Dish",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "20 minutes",
        "rating": 4.9,
        "date_published": "August 3, 2023",
        "imageUrl": "images/golbheda-ko-achar.jpg",
        "comments": [
            "A zesty and flavorful addition to any meal.",
            "Roasting the tomatoes adds a smoky depth to the pickle.",
            "Perfect with plain rice or roti for a balanced meal."
        ]
    },
    {
        "id": 24,
        "name": "Masu",
        "description": "A flavorful Nepali meat curry made with goat or chicken, typically served with rice.",
        "ingredients": [
            "Meat (goat/chicken)",
            "Garlic",
            "Ginger",
            "Onion",
            "Tomatoes",
            "Cumin",
            "Coriander",
            "Ghee"
        ],
        "steps": [
            "Heat ghee in a pan and sauté garlic, ginger, and onions until golden.",
            "Add the meat and cook until browned on all sides.",
            "Stir in tomatoes, cumin, and coriander, and simmer for 45 minutes until the meat is tender.",
            "Serve hot with rice or roti."
        ],
        "meta": {
            "servings": 4,
            "category": "Main Course",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "1 hour",
        "rating": 4.7,
        "date_published": "July 27, 2023",
        "imageUrl": "images/masu.jpg",
        "comments": [
            "Rich and hearty, perfect for a family meal.",
            "Ghee adds a wonderful depth of flavor to the curry.",
            "Great with basmati rice or naan bread."
        ]
    },
    {
        "id": 25,
        "name": "Aloo Achar",
        "description": "A spicy potato pickle, often served as a side dish with rice or roti.",
        "ingredients": [
            "Potatoes",
            "Green chili",
            "Cumin",
            "Garlic",
            "Ginger",
            "Turmeric",
            "Mustard oil"
        ],
        "steps": [
            "Boil potatoes until tender and cut into bite-sized pieces.",
            "In a pan, heat mustard oil and sauté garlic, ginger, cumin, turmeric, and green chili.",
            "Toss the boiled potatoes in the spice mixture and cook for 5-10 minutes.",
            "Serve warm or cold with rice or roti."
        ],
        "meta": {
            "servings": 4,
            "category": "Side Dish",
            "cuisine": "Nepali"
        },
        "total_cooking_time": "30 minutes",
        "rating": 4.6,
        "date_published": "July 30, 2023",
        "imageUrl": "images/aloo-achar.jpg",
        "comments": [
            "A tangy and spicy complement to any main dish.",
            "The mustard oil gives it a distinctive and bold flavor.",
            "Ideal for adding a kick to your meals."
        ]
    }
]